[{"id":250900,"first_name":"Kathleen (Katie)","last_name":"Dunphy","address":"Knockanoran, Durrow,  Laois","lat":"52.8543023","lon":"-7.428077500000001","text":"Wife of the late Bernard. In the loving care of the nurses and staff of Brookhaven Nursing Home, Ballyragget. Deeply regretted by her loving sons Michael and John, daughters Pauline, Marie and Ann, sons-in-law, daughters-in-law, brother-in-law, sisters-in-law, grandchildren, great-grandchildren, niece, relatives and friends.\r\n\r\n                                               \r\n\r\nRest in Peace\r\n\r\nReposing at her daughter Marie's house (Tubberboe, Durrow). Rosary on Saturday eve at 9.00pm. Funeral Prayers on Sunday eve at 6.15pm followed by removal to Holy Trinity Church, Durrow. Requiem Mass on Monday at 11.00am followed by burial in the adjoining cemetery.","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250901,"first_name":"Thomas (Tommy)","last_name":"Murray","address":"Tallaght,  Dublin","lat":"53.288804","lon":"-6.3557063","text":"MURRAY, Thomas (Tommy), (Aylesbury, Tallaght, Dublin and late of Clareen, Birr, Co. Offaly), March 12, 2015, peacefully at St. James’s Hospital; deeply regretted  by his loving wife Nora, daughters Pamela, Susan, Rita and Maria,  grandchildren Tom, Emma and Lucy, sisters Rita, Rose and Bridie, sons-in-law, brothers-in-law, nieces, nephews, relatives and a large circle of friends.\r\n\r\n \r\n\r\nRest in Peace. \r\n\r\n \r\n\r\nReposing at his home on Sunday (15th March, 2015) from 3pm – 8pm. Removal on Monday morning (16th March, 2015) to St. Martin de Porres Church, Aylesbury, arriving for 11am Funeral Mass and afterwards to Bohernabreena Cemetery. ","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250902,"first_name":"Tony","last_name":"Devins","address":"Templeogue,  Dublin","lat":"53.2976886","lon":"-6.321975999999999","text":"Peacefully, in Our Lady’s Hospice, Harold’s Cross.  Beloved son of Maureen and the late Paddy.  Very sadly missed by his loving family, sister Mary, brothers Paul and John, sisters-in-law Teresa and Ronda, nieces, nephews, relatives and friends, especially Phyllis, Belinda, Ken and families. \r\n\r\n \r\n\r\nRest in Peace\r\n\r\n \r\n\r\nReposing at his mother’s residence on Sunday the 15th of March from 4pm.  Removal on Monday morning the 16th of March to the Church of the Holy Spirit, Greenhills, arriving for 10am Funeral Mass and afterwards to Mount Jerome Crematorium, Harold’s Cross.  Family flowers only.  Donations if desired to Our Lady’s Hospice, Harold’s Cross.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250903,"first_name":"Kitty","last_name":"Kelly","address":"Castle Street, Dunmanway,  Cork","lat":"51.7210671","lon":"-9.1172193","text":"Funeral Prayers in St Patrick's Church this Friday evening at 6.30pm. Funeral Mass tomorrow, Saturday, at 11.30am. Burial afterwards in the adjoining cemetery. ","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250904,"first_name":"John","last_name":"O'callaghan","address":"Kilrush, Kanturk,  Cork","lat":"52.1561816","lon":"-8.8715568","text":"Reposing at his residence. House private. Requiem Mass tomorrow, Saturday, at 12 noon in the Church of the Immaculate Conception, Kanturk. Burial immediately afterwards in St. Patrick's Cemetery, Kanturk. ","date_of_death":"2015-03-11","date_published":"2015-03-13"},{"id":250905,"first_name":"Kevin","last_name":"Kiernan","address":"Granard,  Longford","lat":"53.7792706","lon":"-7.491778","text":"Mass and private cremation took place on March 5, 2015.","date_of_death":"2015-03-03","date_published":"2015-03-13"},{"id":250906,"first_name":"Margaret(Maggie)","last_name":"Morgan","address":"Crosslanes, Drogheda,  Louth","lat":"53.717856","lon":"-6.3560985","text":"13th March 2015 at her residence, Crosslanes, Margaret(Maggie), sadly missed by her loving nephews, nieces, relatives and friends.\r\n\r\nREST IN PEACE\r\n\r\nReposing at her residence on Saturday from 4pm to 8pm. Removal on Sunday at 10am for Requiem Mass at 10.30am in Our Lady of Lourdes Church, burial afterwards in St. Peter's Cemetery.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250907,"first_name":"Johnny","last_name":"Philbin","address":"Lislackagh, Swinford,  Mayo","lat":"53.9257478","lon":"-8.9783995","text":"Reposing at Campbells Funeral Home, Swinford on Sunday from 4.30pm until removal at 6.30pm to the Church of Our Lady Help of Christians arriving at 7pm.  Mass on Monday at 12 noon with funeral proceeding to Kilconduff Cemetery.\r\n\r\nFamily flowers only.  Donations if desired to Mayo Roscommon Hospice.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250908,"first_name":"Dermot","last_name":"Mcdermott","address":"Rathview, Ferrybank,  Waterford","lat":"52.2602906","lon":"-7.074866999999999","text":"Dermot Mc Dermott, Rathview, Ferrybank, Waterford and late of Mc Dermott Investments & Finance, who died today, Friday. Reposing in Power's Funeral Home, Ferrybank, on Sunday from 7.45pm followed by prayers at 8.15pm. Removal on Monday to the Sacred Heart Church, Ferrybank, arriving for Requiem Mass at 10am, followed by burial in the adjoining cemetery.\r\n\r\n \r\n\r\nMay He Rest in Peace","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250909,"first_name":"Catherine (Kitty)","last_name":"Flynn","address":"Castleknock,  Dublin / Monaghan","lat":"53.3736519","lon":"-6.3584191","text":"\r\n\tFLYNN (Nee Duffy) (Castleknock, Dublin and formerly of Carrickaghogue, Co. Monaghan) March 13th. 2015 (peacefully), Catherine (Kitty), beloved wife of Patrick (Paddy)  and dear mother of Brendan, Colin, Stephen, Trevor, Anita and Laura and a devoted grandmother of Ciara, Conor, Dáire, Rachel and Katie Marie. Sadly missed by her loving family, sisters Patricia and Margaret, brother Patsy, son-in-law, daughters-in-law, brothers-in-law, sisters-in-law, nephews, nieces, relatives and friends.\r\n\r\n\tR.I.P. \r\n\r\n\tReposing at her residence on Sunday evening from 5pm to 7pm with removal to St. Brigid’s Church, Blanchardstown on Monday morning arriving for Requiem Mass at 11am, followed by burial in Esker Cemetery, Lucan. Family flowers only, please. Donations if desired to St. Francis Hospice, Blanchardstown.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250910,"first_name":"Kevin","last_name":"Barry","address":"Barrack Street, Waterford City,  Waterford","lat":"52.2566055","lon":"-7.1181673","text":"Formerly of Waterford Crystal. Removal from Thompson's Funeral Home, Barrack Street, Waterford, on Saturday at 7.45pm to the Holy Family Church.  Requiem Mass on Sunday at 11am, followed by burial in St. Mary's Cemetery, Ballygunner.","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250911,"first_name":"Liam","last_name":"Flynn","address":"Betaghstown, Clane,  Kildare","lat":"53.3123222","lon":"-6.742871099999999","text":"Liam Flynn, following a tragic accident in Florida, USA, North Carolina and late of Betaghstown, Clane, Co. Kildare. Sadly missed by his heartbroken wife Destiny and 11 month old little girl Leilani, his mother Ann, father Billy, sisters Maria, Norma, Grace, Clair and Leona, brothers Sean and Niall, brothers-in-law, Jeremy, Brian and Ivan, grandmother, nieces, nephews, aunts, uncles, cousins and his many, many friends.\r\n\r\nRest in Peace\r\n\r\nMemorial Mass at Church of St. Patrick and St. Brigid, Clane on Sunday 15th March at 11.30am.","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250912,"first_name":"George","last_name":"Nagle","address":"Dublin 4,  Dublin","lat":"53.32937","lon":"-6.2275049","text":"(Pembroke Road and formerly Fort Lauderdale, Florida) (peacefully) in the wonderful care of the Doctors and Nurses in St. Vincent’s University Hospital after a short illness.  A special thanks to the Matron and the staff in St. John’s House.  Darling husband and best friend of Marie.  Father of George and Laura (U.S.A.), stepfather to David, Louise and Paul.  Will be missed by his family, sisters Evelyn and Iris, brothers-in-law Pat and Charlie, cousins, relatives and friends, especially Joan and Michael. \r\n\r\n \r\n\r\nMay He Rest In Peace.\r\n\r\n \r\n\r\nReposing in St. John’s House, Merrion Road, on Sunday the 15th of March from 2pm to 4pm.  Funeral Mass on Monday the 16th of March at 11am in St. Mary’s Church, Haddington Road followed by Private cremation in Mount Jerome, Harold’s Cross.  Family flowers only please.  Donations in lieu to the Alzheimers Society.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250913,"first_name":"Liam","last_name":"Burns","address":"Deerpark, Ballyfin,  Laois / Belfast, Antrim","lat":"54.7195338","lon":"-6.2072498","text":"Liam(Formely of Belfast). Deeply regretted by Grealdine, Keith, Declan, Aoife and his sisters Ann and P.J. and their Families.\r\n\r\nRest In Peace\r\n\r\nRemains arriving for 12 noon Requiem Mass in SS Peter and Pauls Church Portlaois on Wednesday March 18th. Cremation later. Family Flowers only. Donations if desired to Palliative care unit St. Vincents Hospital Mountmellick.","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250914,"first_name":"Pat","last_name":"Mc geough","address":"Cortaghart, Latton PO, Castleblayney,  Monaghan","lat":"54.120659","lon":"-6.7397374","text":"Pat, Mc Geough, Cortaghart, Latton PO, Castleblayney, Co Monaghan.  Friday 13th of March, peacefully at Cavan General Hospital. Surrounded by his loving family, brothers Mick, Brian, Jim & Frank, sisters Kathleen Mc Mahon, Mary Dowd, Margaret Mc Geough, brothers-in-law, sisters-in-law, nephews, nieces, relatives and friends.\r\n\r\n \r\n\r\nRemains reposing at his home from 7pm this Friday evening until removal on Sunday morning at 12.30pm to arrive at Saint Mary's Church, Carrickatee for 1pm funeral mass. Interment afterwards in adjoining cemetery.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250915,"first_name":"Francis","last_name":"Whelan","address":"Blanchardstown,  Dublin / Cabra, Dublin","lat":"53.3519699","lon":"-6.3940572","text":"WHELAN (Blanchardstown, and formerly  Annamoe Park, Cabra) 12th March 2015, Francis, beloved husband, father, grandfather and brother.  Sadly missed by his family, relatives and friends.\r\n\r\nR.I.P. \r\n\r\nReposing at Jennings Funeral Home, Main St, Blanchardstown, tomorrow, Saturday, from 3pm.  Funeral Mass at 11am on Monday at St Philip the Apostle Church, Mountview, Dublin 15, followed by cremation at Glasnevin. ","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250916,"first_name":"Nancy","last_name":"Homan","address":"Killiney,  Dublin","lat":"53.2650114","lon":"-6.1149485","text":"Nancy Homan (née McCartney) of Killiney, Co. Dublin died on 13th March, 2015, peacefully, in her 96th year, in the loving care of Liz, Pat and the staff at Eyrefield Manor Nursing Home, Greystones, beloved wife of the late Frederick, much-loved mother of Phyllis, David, Ruth, John, Charles and the late Alan; sadly missed by her grandchildren, great- grandchildren, daughters-in-law, son-in-law, relatives and many friends. \r\n\r\n \r\n\r\nFuneral Service on Thursday, March 19, at 11.00am in St. Matthias’ Church, Church Road, Killiney/Ballybrack, Co. Dublin, followed by burial in Shanganagh Cemetery. Family flowers only please. Donations, if desired to MS Ireland.","date_of_death":"2015-03-13","date_published":"2015-03-15"},{"id":250917,"first_name":"Patrick","last_name":"O'connor","address":"Ferry Road, Leigh, Ballyduff,  Kerry","lat":"52.45455159999999","lon":"-9.662905199999999","text":"O’Connor Ferry Road, Leigh, Ballyduff, Tralee, Co. Kerry – 12th March, 2015 peacefully, after a short illness, at Kerry General Hospital, PATRICK. Deeply regretted by his loving Wife Imelda, Sons, Cathal, Barry, Aidan, Eoin, Niall and Ian, daughters Rachael, Eamyr and Lorna, brother Richard, uncle Jimmy Boyle,  Daughters-in-law,  sons-in-law, grandchildren, brothers in law, sisters in law, nieces, nephews, relatives and friends.\r\n\r\nRest In Peace\r\n\r\nReposing at Lawlor’s Funeral Home on Sunday evening from 4pm to 7pm followed by removal at 7pm to S.S. Peter & Paul’s Church, Ballyduff.  Requiem Mass on Monday at  11am. Burial afterwards in Derrico Cemetery.  Family Flowers only please.","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250918,"first_name":"Julia (Judy)","last_name":"Kavanagh","address":"Kilkeaskin, Carbury,  Kildare","lat":"53.3310393","lon":"-6.908019299999999","text":"In her 81st year (peacefully) in the wonderful care of the staff of Parke House Nursing Home, Kilcock. Julia (Judy), mother to the late John Francis, Margaret, Sheila and Seamus. Sadly missed by her loving husband John and much loved mother of Bernie, John and Yvonne, brother Joseph, sons-in-law, daughters-in-law, sisters-in-law, grandchildren, great grandchildren, nieces, nephews, relatives and friends.\r\n\r\nRest in Peace\r\n\r\nReposing at Larkin’s Funeral Home, Edenderry from 8pm this Saturday evening with Rosary at 9pm.  Removal on Sunday at 12.30pm, arriving  to Holy Trinity Church, Derrinturn for 1pm Funeral Mass.  Burial afterwards in adjoining cemetery.\r\n\r\n ","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250919,"first_name":"Martin","last_name":"Cunningham","address":" Dublin","lat":"53.3498053","lon":"-6.2603097","text":"Cunningham, Martin, March 12th, 2015. Suddenly. Beloved husband of Eileen and father of Martin, Robert, Gary and Paul. Sadly missed by his wife, sons, grandchildren Cían, Calum, Lee, baby Martin and Mia, his father Peter, brothers, sister, nephews, niece, relatives and friends.\r\n\r\nR.I.P. \r\n\r\nReposing on Saturday at Jennings Funeral Home, Amiens Street, from 1pm to 5pm. Reposing on Sunday at his residence from 2pm. Removal on Monday from his residence to Our Lady of Lourdes Church, Sean McDermott Street, arriving at 9.50am for 10am Mass. Funeral afterwards to Fingal Cemetery. ","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250920,"first_name":"Nancy","last_name":"Kennedy","address":"Lynn, Mullingar,  Westmeath / Cloghan, Donegal","lat":"54.8410263","lon":"-7.933839","text":"Nancy Kennedy (nee Houston)  – Lynn, Mullingar, and late of Letterbrick, Co Donegal, March 13, 2015 (peacefully);  beloved wife of the late Michael; deeply regretted by her son Gearóid,  daughter-in-law Mary, grandchildren Patrick, Henry and Joseph, sister Sally, nieces, nephews, relatives and friends. \r\n\r\nMAY SHE REST IN PEACE\r\n\r\nReposing at Gilsenan’s Funeral Home on Saturday from 5.30pm, followed by removal to the Cathedral of Christ the King arriving at 7pm. Funeral Mass on Sunday at 12.30pm, with burial immediately afterwards in Ballyglass Cemetery. \r\n\r\nHouse private","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250921,"first_name":"Mary","last_name":"Power","address":"Priorstown, Kilsheelan,  Tipperary","lat":"52.36912909999999","lon":"-7.604026599999999","text":"Mary Power (nee Corcoran) Priorstown, Kilsheelan, Clonmel, Co. Tipperary, 12th March 2015 at South Tipperary General Hospital, Mary (Muggy), (S.R.N.), in her 94th year. Pre-deceased by her husband Pierce and son Jack. Very deeply regretted by her loving daughters Anne, Eleanor, Maede, Teresa, Catherine and Siobhan, sons Pierce and Paul, brothers Rev. William Corcoran (New Zealand) and John, sons in law, daughter in law, grandchildren, great grandchildren, nephews, nieces, relatives and her fond friend Kate, neighbours and a wide circle of friends.\r\n\r\nRest in Peace\r\n\r\nReposing at O'Donoghue's Funeral Home, Kickham St., Clonmel on Sunday evening from 4pm to 7pm. Funeral arriving at Gambonsfield Church, Kilsheelan at 11.45am on Monday for Requiem Mass at 12noon. Burial immediately afterwards in adjoining cemetery.","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250922,"first_name":"Norah","last_name":"Byrne","address":"Gracefield, Ballylinan,  Laois / Portlaoise, Laois","lat":"53.0328123","lon":"-7.298793300000001","text":"Formerly Clonboyne, Portlaoise.   Deeply regretted by her loving sons Eddie and Willie, daughter Helen, brothers, sisters, brothers and sisters-in-law, nieces. nephews, relatives and friends.  Reposing at Rigney's Funeral Home, Athy from 2pm Saturday afternoon with removal on Saturday evening at 5.30pm to arrive at St. Anne's Church, Ballylinan at 6pm.   Funeral Mass on Sunday at 11.30am.   Burial afterwards in the adjoining Cemetery.\r\n\r\n \r\n\r\nMay Norah Rest in Peace","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250923,"first_name":"Martin J.","last_name":"Kelly","address":"Celbridge,  Kildare / Roscommon","lat":"53.339897","lon":"-6.538458899999999","text":"KELLY Martin J. (Celbridge, Co. Kildare, formerly of Cregameen, Co. Roscommon and ex. Teagasc, Naas and Kildare Archaeological Society) March 13th. 2015 (peacefully) after a short illness. Beloved husband of Alice and dear father of Bernadette, Peter, Martin, Ailish, Anne, Carmel, John and Patrick; Sadly missed by his family, grandchildren, sons-in-law, daughters-in-law, sister Mary, Peter, sisters-in-law, cousins, nieces, nephews, relatives and friends.\r\n\r\nRest In Peace\r\n\r\nReposing at Cunningham’s Funeral Home, Ardclough Road, Celbridge on Sunday evening from 6pm to 8pm with removal on Monday morning to St. Patrick’s Church, Celbridge arriving for Requiem Mass at 11am followed by burial in Donacomper Cemetery. Family flowers only, Please. Donations if desired to Trócaire.\r\n\r\n“Ar dheis Dé go raibh a anam dílis”","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250924,"first_name":"Nora","last_name":"Murray","address":"Esker, Ballymacward, Ballinasloe,  Galway","lat":"53.4018342","lon":"-8.489609399999999","text":"Murray (née Kelly) Nora, in her 95th year, (Esker, Ballymacward, Ballinasloe, Co. Galway) - March 12, 2015, (peacefully) at UCHG, surrounded by her loving family, predeceased by her husband Malachy; deeply regretted by her son Bobby, daughter Mary Egan (Menlough), daughter-in-law Chris and son-in-law Michael, beloved grandmother of Gerard, Anne-Marie, Aiden, Clare, Martina, John and Michelle, great-grandmother to James and Lily; sadly missed by her nieces and nephews, extended family neighbours and friends.\r\n\r\nR.I.P. \r\n\r\nReposing at her residence tomorrow, Saturday, from 5pm to 8pm. Removal on Sunday for Requiem Mass at 1pm in St. Peter and Paul's Church Ballymacward. Burial afterwards in the New Cemetery Ballymacward. House private on Sunday morning please, by request of family.","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250925,"first_name":"Thomas","last_name":"Mcgrane","address":"Drumcondra,  Dublin","lat":"53.3706206","lon":"-6.253765","text":"McGrane (Clonliffe Road and Chief Instructor Karate Union of Ireland), 12th March 2015, peacefully in the care of the staff at St. Francis Hospice, Raheny, Thomas (Tommy), beloved husband of the late Sheila. He will be sadly missed by his loving children Colette, Thomas, Michael, Anthony, Linda, David, Debbie and Vinny and families, partner Vera, sister Pattie, brother, John, extended family, friends and neighbours.\r\n\r\nRest in Peace.\r\n\r\n\r\nReposing at The Kirwan Funeral Home, Fairview Strand, with a family gathering on Sunday afternoon from 3.30pm until 5.30pm, all welcome.. Removal on Monday morning to The Church of the Visitation, Fairview due at 9.50am, with Funeral after 10am Mass to Glasnevin Cemetery. Family flowers only. Donations, if desired to St. Francis Hospice.","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250926,"first_name":"Hugh","last_name":"Reynolds","address":"Cavan Road, Ballyjamesduff,  Cavan","lat":"53.86742109999999","lon":"-7.2112911","text":"Hugh Reynolds, Cavan Road, Ballyjamesduff. Co. Cavan. Retired Garda. Died Wednesday 11th March 2015, Suddenly at home. Deeply regretted by his loving wife Noeleen, Children; Hugh Jnr., Patrick, Barry, Catherine and Cormac, Brother Patrick, Sisters; Rosemary and Veronne, Grand-daughters Zoe and Zara, Daughters in Law; Michelle, Meabh and Connie, Relatives and Friends.\r\n\r\nRest In Peace\r\n\r\nFuneral Mass on Sunday at 1pm in St. Joseph's Church, Ballyjamesduff. Interment afterwards in the New Cemetery.\r\n\r\nHouse Private Please.","date_of_death":"2015-03-11","date_published":"2015-03-13"},{"id":250927,"first_name":"Sean (Seanie)","last_name":"Edwards","address":"Drimnagh,  Dublin","lat":"53.32641","lon":"-6.31884","text":"Edwards Sean (Seanie) March 12, 2015, (late of Drimnagh) (Suddenly) at St. James's Hospital, beloved son of Michael and the late Rita and loving brother of Marie and Betty. Sadly missed by his loving father, sisters, nieces Amanda, Deborah and Carla, nephew Jason, grand-niece, grand-nephews, extended family and friends.\r\n\r\n \r\n\r\nMay He Rest in Peace\r\n\r\n \r\n\r\nReposing at the Brian McElroy Funeral Home, Crumlin Village, on Saturday from 10am to 5pm. Funeral on Monday after 10am Mass in St. Agnes's Church, Crumlin Village to Palmerstown Cemetery.","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250928,"first_name":"Kathleen","last_name":"Cummins","address":"Rathnaveen, Tipperary Town,  Tipperary","lat":"52.5008","lon":"-8.15038","text":"Cummins (nee Doherty) March 13th, 2015, Kathleen, Rathnaveen, Tipperary Town. Sadly missed by her loving family; husband Henry, sons John, Colin and Mark, sister Noreen, grandchildren, daughters-in-law, brothers-in-law, nephews, nieces, relatives, kind neighbours and friends.\r\n\r\nR.I.P.\r\n\r\nReposing at her residence this Saturday evening from 3.30pm to 7pm. Requiem Mass on Sunday at 12.30pm in St. Michael’s Church, Tipperary and funeral afterwards to St. Michael’s Cemetery, Tipperary. Family flowers only. Donations, if desired, to South Tipperary Hospice.  House private on Sunday morning, please.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250929,"first_name":"Mary","last_name":"Doyle","address":"Matthew Avenue, Thurles,  Tipperary","lat":"52.6788409","lon":"-7.819884599999999","text":"March 13th, 2015, Matthew Avenue and late of Coolgrane, Thurles; peacefully at Ardeen Nursing Home; deeply regretted by her sisters Delia Condon, Margaret St. John, brother Frank Doyle, nieces, nephews, relatives and friends.\r\n\r\nMay She Rest in Peace\r\n\r\nReposing at Ardeen Nursing Home Saturday March 14th from 3pm to 5.30pm arriving at The Cathedral of the Assumption at 6.15pm.  Requiem Mass on Sunday at 12 noon.  Burial afterwards in Loughmore Cemetery.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250930,"first_name":"Michael (Mikey)","last_name":"Keane","address":"Cullenstown, Duncormick,  Wexford","lat":"52.2285412","lon":"-6.655054199999999","text":"Beloved husband of Anne and father of Marianne, Michael, Gerard and Brendan. Sadly missed by his loving family son in law, daughters in law, grandchildren, great grandchildren, sisters Molly, Anne and Teresa, nephews, nieces, relatives and friends.\r\n\r\nMay He Rest In Peace.\r\n\r\nReposing in Ryan's funeral home Wellingtonbridge from 2pm on Saturday with removal at 6.30pm to the Church of Mary Immaculate and St Joseph Carrig on Bannow. Funeral Mass on Sunday at 11am burial afterwards in the adjoining cemetery.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250931,"first_name":"NORAH","last_name":"Crowe","address":"Monroe, Clonoulty,  Tipperary","lat":"52.6045063","lon":"-7.9893219","text":"Crowe, Norah (formerly of Monroe, Clonoulty, Co. Tipperary) 12 March 2015, at South Tipperary General Hospital, Clonmel. Predeceased by her brother Patrick, sisters Mae (Sr. Imelda , New Inn), and Stella (London). Sadly missed by her sister Delia, nephews, nieces, relatives and friends.\r\n\r\nRest in peace.\r\n\r\nRemoval on Monday morning to Glasnevin Crematorium Chapel arriving for 10am Prayers and Cremation Service. Burial of ashes, at a later date, at family cemetery at Kilpatrick Co Tipperary.","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250932,"first_name":"ITA","last_name":"Barry","address":"Dublin 4,  Dublin","lat":"53.32937","lon":"-6.2275049","text":"Barry, Ita (Mespil Estate, Sussex Road, Dublin 4) 12th March 2015 (peacefully) at Ailsbury Nursing Home, Sandymount, Dublin 4; Beloved sister of Joan and Helen, and pre-deceased by her brother Jack. Sadly missed by her family, brother-in-law George, sister-in-law Catherine, nieces, nephews and all her relatives and her two dear friends.\r\n\r\nRest In Peace.\r\n\r\nReposing in Fanagans Funeral Home, 54 Aungier Street, from this Sunday. Removal on Wednesday morning to the Church of the Sacred Heart, Donnybrook arriving at 9.50am for Funeral Mass at 10.00am followed by cremation in Mount Jerome. Family flowers only please. All enquiries to Fanagans at (01) 4754101.","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250933,"first_name":"John Joe","last_name":"Finnerty","address":"Mornington,  Meath","lat":"53.71847150000001","lon":"-6.274648900000001","text":"(Peacefully), beloved husband of the late Monica and deeply loved father of Dermot, Ciara and Gary; much loved brother of Pat, Brendan and the late Martin.  Deeply regretted by daughter-in-law Alma, grandchildren Joey and Moya; sadly missed by his sisters-in-law, brother-in-law, nephews, nieces, relatives and friends.\r\n\r\nMay he Rest in Peace.\r\n\r\nReposing at his home on Saturday from 4pm to 9pm. Funeral Mass on Sunday at 2pm in the Star of the Sea Church, Mornington. Burial afterwards in Reilig Mhuire, Piltown.\r\n\r\nFamily flowers only. \r\n\r\nHouse private on Sunday please.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250934,"first_name":"Michael","last_name":"Flynn","address":"Cranavaneen, Newport,  Tipperary","lat":"52.7113844","lon":"-8.4073744","text":"Flynn, Michael, Cranavaneen, Newport, Co. Tipperary.  13th March 2015 peacefully at Bushy park nursing home Borrisokane.  Deeply regretted by his loving sisters, brothers in law, nephews, nieces, relatives, neighbours  and friends.\r\n\r\nRest in Peace.\r\n\r\nReposing at Meehan's funeral home Newport on Saturday evening from 5.30pm with removal at 7pm to Newport Church.  Requiem Mass on Sunday at 11.30am, burial afterwards in Rockvale Cemetery Newport.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250935,"first_name":"Patrick","last_name":"Kealy","address":"Closh, Kilbride, Ballon,  Carlow","lat":"52.73293469999999","lon":"-6.7470113","text":"Reposing at Byrne's Funeral Home Tullow from 3pm on Saturday with removal at 6.45pm to S.S. Peter & Paul Church Ballon for arrival at 7.20pm. Funeral after 11am Mass on Sunday to local cemetery.\r\n\r\nMay He Rest In Peace","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250936,"first_name":"Sydney and Lorna","last_name":"Graham","address":" Dublin","lat":"53.3498053","lon":"-6.2603097","text":"Suddenly, at home. Sadly missed by their loving children Lloyd, Keith and Lindsay, grandchildren Daniel, Robyn and Kevin, brothers, sister, brothers-in-law, sisters-in-law, extended family and friends. \r\n\r\n \r\n\r\nFuneral Service on Monday morning at 11am in Zion Parish Church, Zion Road, Rathgar and afterwards to Mt Jerome Cemetery.\r\n\r\nFamily flowers only, please. Donations, if wished, to the Alzheimer's Society of Ireland.","date_of_death":"2015-03-09","date_published":"2015-03-13"},{"id":250937,"first_name":"Eva","last_name":"Douglas","address":"Pottery Road, Dun Laoghaire,  Dublin","lat":"53.27359569999999","lon":"-6.1536354","text":"March 13th 2015 (peacefully) in the loving care of the staff at St Vincent’s University Hospital, Elm Park; Eva. She will be very sadly missed by her loving children Paula, Joe, Pat and Sharon, sons-in-law, daughters-in-law, grandchildren, great-grandchildren, sisters-in-law, brothers-in-law, nieces, nephews, relatives, friends and neighbours.  A special word of thanks to all the staff at the Cois Ceim Nursing Home, Clonskeagh.\r\n\r\nMay She Rest In Peace.\r\n\r\nReposing at Patrick O’Donovan & Son Funeral Home, Sallynoggin (Opp Sallynoggin Church) Removal this Saturday evening to St Brigid’s Church, Cabinteely arriving at 5 00pm.  Funeral on Monday morning after 10am Requiem Mass to Shanganagh Cemetery, Shankill.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250938,"first_name":"Terence","last_name":"Mcsweeney","address":"Stella Maris, Ballycastle,  Mayo","lat":"54.2796698","lon":"-9.372464299999999","text":"Formerly Boston USA. Reposing at Conneelys Funeral Home, Flood St. Galway on Sunday 15th from 4.30pm until 6pm. Removal on Monday 16th March to Mount Jerome Crematorium Harold's Cross Dublin for mass at 3pm. Cremation will be held afterwards. No Flowers by request.\r\n\r\nMay He Rest In Peace","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250939,"first_name":"Patrick (Eamon)","last_name":"O'kelly","address":"Kilmore West,  Dublin","lat":"53.3930026","lon":"-6.2204254","text":"O’Kelly Patrick (Eamon) Kilmore West, (late of Dublin City Council Paving Dept.) 13th March 2015, peacefully, after a long illness in Beaumont Hospital, surrounded by his loving family and friends. Father of the late Philo, very sadly missed by his beloved wife Agnes, sons, daughters and their partners, grandchildren, great-grandchildren, brothers, sisters, relatives, neighbours and friends.\r\n\r\nR.I.P.\r\n\r\nReposing in Jennings Funeral Home, Oscar Traynor Road, Coolock. Removal on Monday to St. Luke Evangelist Church, Kilmore West, arriving for 12 noon Funeral Mass followed by cremation in Glasnevin Crematorium. Family flowers only.  Donations if desired to Oncology Ward Beaumont Hospital.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250940,"first_name":"Patrick (Paddy)","last_name":"Mayne","address":"Finglas West,  Dublin","lat":"53.3906692","lon":"-6.3122566","text":"Mayne (Finglas West) 12th Feb 2015 in St Francis Hospice, Blanchardstown, peacefully, surrounded by his loving family and friends. Patrick (Paddy), son of the late Brian and Claire. He will be very sadly missed by his loving daughter Kayla, sisters Thelma, Linda, Collette and Emily brothers Phillip and Brian, nephews, nieces and extended family and wide circle of friends.\r\n\r\n \r\n\r\nMay He Rest in Peace\r\n\r\n \r\n\r\nReposing at his sister Linda’s home tomorrow, Saturday, from 6pm to 8pm and on Sunday from 2pm to 6pm. Removal on Monday to The Church of the Annunciation, Finglas West, arriving at 9.45am for Requiem Mass at 10am, followed by cremation to Glasnevin Crematorium. All enquiries to Massey Bros on 018361011.","date_of_death":"2015-03-12","date_published":"2015-03-13"},{"id":250941,"first_name":"JAMES (JIM)","last_name":"Dwyer","address":"Five Mile Bridge, Ballinhassig,  Cork","lat":"51.81618169999999","lon":"-8.494630599999999","text":"Dwyer (Five Mile Bridge, Ballinhassig) On March 13th 2015, peacefully, in the presence of his loving family at St. Oliver’s Ward, St. Finbarr’s Hospital, James (Jim) (in his 91st Year), beloved husband of the late  Catherine (Kitty, nee Collins) and loving father of Vincent, Leo, Gus and Catherine.  Sadly missed by his loving family, daughters-in-law, son-in-law, grandchildren, sisters-in-law, nephews, nieces, relatives and friends. \r\n\r\nMay he rest in peace. \r\n\r\nReposing at Sullivans Funeral Home Turners Cross.  Removal on Sunday (15th) at 4pm to the Sacred Heart Church, Belgooly. Requiem Mass on Monday (16th) at 2pm.  Funeral afterwards to St. Patrick’s Cemetery, Nohoval.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250942,"first_name":"Paul","last_name":"Devaney","address":"Leahive, Creggs,  Galway / Creggs, Roscommon","lat":"53.6275906","lon":"-8.189095499999999","text":"(Suddenly); in London. He will be very sadly missed by his loving wife Bettina, daughter Tara, son Paul, mother Mary, sisters Theresa, Fiona and Yvonne, brothers Thomas, Francis and Joe, aunts, uncles, nieces, nephews, extended family, relatives, neighbours and many friends.\r\n \r\n\r\nMay He rest in peace.\r\n\r\n\r\nReposing at Smyth’s Funeral Home, Roscommon on Wednesday evening from 4.30 o’c followed by Removal at 7 o’c to St Mary’s Church, Kilbegnet. Mass of the Resurrection on Thursday at 12 o’c. Burial afterwards in Kilbegnet Cemetery.\r\n\r\nFamily flowers only please. Donations if desired to the Barry Harris Walk Team \r\n\r\n \r\n\r\n \r\n\r\n ","date_of_death":"2015-03-09","date_published":"2015-03-16"},{"id":250943,"first_name":"M.M.M.","last_name":"Mccarroll","address":"Drogheda,  Louth","lat":"53.717856","lon":"-6.3560985","text":"McCarroll, Sr. Bernard, Medical Missionaries of Mary, Drogheda, Co. Louth and formerly of Croy, Glasgow, Scotland, 13th March 2015, peacefully in Aras Mhuire Nursing Facility, Drogheda. Greatly missed by her brothers, sisters and their families, her many relatives and friends and her M.M.M. Community.\r\n\r\nREST IN PEACE\r\n\r\nFuneral Mass at 12 noon in the Convent on Monday 16th March, followed by burial in St. Peter's Cemetery.","date_of_death":"2015-03-13","date_published":"2015-03-13"},{"id":250944,"first_name":"Tony","last_name":"Fenton - fagan","address":"Merrion Woods, Blackrock,  Dublin","lat":"53.3054493","lon":"-6.2031515","text":"FAGAN, Tony aka The Fentone (of Merrion Woods, Blackrock, Co. Dublin) - March 12, 2015 (peacefully), and with his usual dignity, at St. Vincent's Private Hospital, preceeded in death by his mother and father Ethna and Brendan Fagan; deeply regretted by his loving family Paul, Ann, Colm, Kevin, his nieces and nephews Maggie, Bridget, Laura, Alex, Jack and Jordan and his beloved Sinead, he will be greatly missed by the dudes, everyone in Today FM and his many devoted listeners.\r\n\r\n \r\n\r\nMay he rest in peace and eternal light in his new station.\r\n\r\n \r\n\r\nReposing at Fanagan's Funeral Home, Aungier Street on Sunday from 12 noon to 6pm. Removal on Monday at 10.25am to the Church of the Sacred Heart, Donnybrook for 11am Mass, Funeral afterwards to Glasnevin Cemetery.","date_of_death":"2015-03-12","date_published":"2015-03-13"}]